/* 1.  Попросіть користувача ввести свій вік за допомогою prompt.
Якщо вік менше 12 років, виведіть у вікні alert повідомлення про те,
що він є дитиною, якщо вік менше 18 років, виведіть повідомлення про те,
що він є підлітком, інакше виведіть повідомлення про те, що він є дорослим.

Завдання з підвищенною складністю.
Перевірте чи ввів користувач саме число в поле prompt. Якщо ні, то виведіть повідомлення, що введено не число.*/


let userAge = prompt("Введить Ваш вік");

if (userAge < 12) {
    alert("Ви є дитиною!")
    
} else if (userAge >= 12 && userAge < 18) {
    alert("Ви підліток!")
    
}
else if (userAge > 18 ) {
    alert("Ви вже дорослий!")
}
    
else  {
    alert("Введено не число!");
};


/* 2. Напишіть програму, яка запитує у користувача місяць року (українською мовою маленкими літерами) та виводить повідомлення, скільки днів у цьому місяці. Результат виводиться в консоль. Скільки днів в кожному місяці можна знайти тут в розділі Юліанський і Григоріанський календарі - https://uk.wikipedia.org/wiki/%D0%9C%D1%96%D1%81%D1%8F%D1%86%D1%8C_(%D1%87%D0%B0%D1%81)
(Використайте switch case)*/



let month = prompt("Введить місяць року українською мовою маленкими літерами");

switch (month) {
  case "січень":
    alert("у цьому місяці - 31 день");
    break;
  case "лютий":
    alert("у цьому місяці - 28 днів або 29 у високосний рік");
    break;
  case "березень":
    alert("у цьому місяці - 31 день");
    break;
  case "квітень":
    alert("у цьому місяці - 30 днів");
    break;
  case "травень":
    alert("у цьому місяці - 31 день");
    break;
  case "червень":
    alert("у цьому місяці - 30 днів");
    break;
  case "липень":
    alert("у цьому місяці - 31 день");
    break;
  case "серпень":
    alert("у цьому місяці - 31 день");
    break;
  case "вересень":
    alert("у цьому місяці - 30 днів");
    break;
  case "жовтень":
    alert("у цьому місяці - 31 день");
    break;
  case "листопад":
    alert("у цьому місяці - 30 днів");
    break;
  case "грудень":
    alert("у цьому місяці - 31 день");
    break;

  default:
    alert("Перевірте правильне написання місяця українською мовою!");
}


